config/bash-parser/core/bash-parser-protocol.org
#+title: Bash Parser Protocol
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle bash-parser-protocol.el
#+auto_tangle: t

* Introduction

Shared protocol module for bash parser subsystems.

This module contains forward declarations for cross-module interfaces,
establishing the protocol between semantics and file-ops modules without
creating circular dependencies.

The protocol clarifies the dependency graph:
- Protocol module has no dependencies (loaded first)
- Semantics module requires protocol (gets interface declarations)
- File-ops module requires protocol (gets interface declarations)
- Both modules can call each other's functions safely

* Basic Configuration

Setup lexical binding.

#+begin_src emacs-lisp
;;; bash-parser-protocol.el --- Bash parser shared protocol -*- lexical-binding: t; -*-

;; Author: Jeff Farr
;; Keywords: bash, parser, protocol
;; Package-Requires: ((emacs "27.1"))

;;; Commentary:

;; Shared protocol module for bash parser subsystems.
;; Contains forward declarations for cross-module interfaces.

;;; Code:
#+end_src

* Forward Declarations

** Functions from bash-parser-file-ops

These functions are implemented in bash-parser-file-ops but called from
bash-parser-semantics.

#+begin_src emacs-lisp
;; Glob pattern detection
(declare-function jf/bash--has-glob-pattern-p "bash-parser-file-ops"
                  (file-path))

;; Path variable resolution
(declare-function jf/bash--resolve-path-variables "bash-parser-file-ops"
                  (file-path var-context &optional debug))

;; Exec block extraction
(declare-function jf/bash-extract-from-exec-blocks "bash-parser-file-ops"
                  (parsed-command var-context))

;; Flag matching
(declare-function jf/bash--flag-present-p "bash-parser-file-ops"
                  (flag flags-list))
#+end_src

** Functions from bash-parser-semantics

These functions are implemented in bash-parser-semantics but called from
bash-parser-file-ops and bash-parser-variables.

#+begin_src emacs-lisp
;; Command handler lookup
(declare-function jf/bash-lookup-command-handlers "bash-parser-semantics"
                  (command-name))

;; Command semantics extraction
(declare-function jf/bash-extract-command-semantics "bash-parser-semantics"
                  (parsed-command))
#+end_src

* Shared Configuration

** Maximum Recursion Depth

#+begin_src emacs-lisp
(defvar jf/bash-recursive-max-depth 10
  "Maximum recursion depth for semantic analysis and nested command parsing.
Prevents infinite recursion in pathological cases.
Shared by bash-parser-orchestrator and bash-parser-extensions modules.")
#+end_src

* Provide

#+begin_src emacs-lisp
(provide 'bash-parser-protocol)
;;; bash-parser-protocol.el ends here
#+end_src
